import "./App.css";
import { MetaTag } from "./MetaTag";

function App() {
  return (
    <div className="App">
      <MetaTag
        title="GLAM"
        description="복잡하고 어려운 사랑을 누구나 쉽고 재미있게 할 수 있다면요? 외로움은 욕망을 충족시킬 수 없어요 사랑만이 사람들의 욕망을 충족시키고 삶을 지속하는 원동력이 될거예요"
        url="https://seoglam.netlify.app/"
        img="https://postfiles.pstatic.net/MjAyMjEwMDZfMTI2/MDAxNjY1MDYxNTU3OTQ3.d5lXb_nQ9jd5MyM1lRBo5HIGUt2u1KY5IMXH6s8-yGEg.peP6JQivR5rf1EB7T9JCrxJ3-kqSGctCPHE8qRczEcYg.JPEG.dreamkonkuk/%EA%B8%80%EB%9E%A8_%EA%B3%A0%EB%A1%9C.jpg?type=w966&jopt=2"
      />
      <h1>This is the home page 🏡 </h1>
      <h2>
        나의 첫 연애는 이별과 사귐의 반복이었다. 우린 1년간 7번 다시 만나고
        8번째 헤어졌다. 그건 내게 트라우마로 남아있다. 우린 CC였지만 흔히 말하는
        인싸와 아싸처럼 다른 학교생활을 했다. 난 학생회에 참여하며 선후배와의
        관계에 많은 시간을 보냈고 장학금을 받았지만, 그 사람은 학교생활엔 관심이
        없었다. 그 사람은 내가 학교생활보다 둘만의 시간에 집중해주길 바랐다. 그
        사람은 연락이 사랑의 척도라 생각했다. 연락과 사랑의 크기는 비례한다고.
        하지만 난 연락에 서툴렀다. 바쁜 날에는 몇 시간씩 연락하는 걸 잊곤 했다.
        연락을 위해 매일 아침 10시, 점심 1시, 저녁 11시, 3개의 알림을 맞췄다. 난
        그 사람을 참 좋아했고 관계를 이어 나가고 싶었으니까. 점심 알람이 울리면
        습관적으로 핸드폰을 열어 무얼 먹었냐 물었다. 그 사람은 김치찌개를
        먹었다고 했다. 나는 그놈의 김치찌개가 전혀 궁금하지 않았지만, 관심있는
        척 연기를 했다. 그렇다고 그 사람을 좋아하지 않은 건 아니었다. 헤어지고
        싶지 않아서 그 사람의 감정을 공감하는 척 연기까지 하며 노력했으니까.
        관계는 맞추는 것이라고 배웠고, 안 맞는 건 노력으로 극복할 수 있다고
        믿었다. 하지만 노력은 의미 없었다. 서로의 관계에 소홀할 때면 우린 어김
        없이 다퉜고 이별 통보를 받았다. 그럴 때마다 자책하며 붙잡기를 일곱 번
        반복했다. 잘자라는 연락을 놓쳤던 날 새벽 7시에, 장문의 이별 통보 카톡을
        받으며 결국 우린 여덟 번째 헤어졌다. 첫 연애의 후유증은 심했다. 그 이별
        통보들은 트라우마가 되었다. 트라우마 때문에 이후 연애에서도 다정한 척
        연기를 하고, 역시나 알림을 설정해 연락을 했다. 연락을 놓쳤다는 생각이 들
        때마다 이별 통보가 올까 불안했다. 내가 연애부적응자가 아닐까 의심을
        했다. 연락을 안 하든 자주 하든 어쨌든 나라는 사람이 문제인 건가?
        재밌게도 두 번째 연인은 내가 연락이 잦아 불편했다고 했다. 난 혼란에
        빠졌다. 그 후 몇 년간 많은 사람들을 만나며 알게 되었다. 관계는 맞춰가는
        것보단 발견하는 것에 가깝다는걸. 내가 누구이며, 누구랑 맞는지 알고 난
        후의 관계들은 편안했다. 나는 일과 목표를 사랑하면서도 타인의 감정에
        공감하고 위로하는 걸 어려워하는 ENTJ 성향이었다. 감정에 공감하지 못하고
        힘들어하는 건 자책할 것도 병도 아니라 그저 하나의 성향이었다. 일에 대한
        나의 열정과 배울 점을 좋아하는 연인들을 만났다. 나와 잘 맞았던 연인들의
        성향은 모두 같았다. 미래에 대한 호기심과 열정 있는 평화주의자 ENFP.
        친절하고 이해심 많은 그들과 만나는 게 좋았다. 서로에게 억지로 맞추지
        않아도 편했다. 더 이상 점심시간에 뭘 먹었는지 억지로 궁금하지 않아도
        되었고, 연락을 위한 알림도 설정하지 않았다. 많은 사람들이 과거의 나처럼
        인간관계, 연인과 헤어짐에 지쳐 로맨스 영화 속 사랑 이야기는 나와는 먼
        얘기라 생각한다. 그저 참고 맞추다 보면 극복할 수 있다고 믿으며 말이다.
        하지만 나와 성향이 잘 맞는 사람을 만나서 그 관계가 주는 안정감과 행복을
        느낄 때, 우리는 영화 속 주인공이 된다. 잘 맞는 관계는 맞추는 게 아니라
        발견하는 것이다. 내게 행복을 줬던 ENFP들을 추억하며 엔프피 서비스를
        만들었다. 이 서비스를 통해 사람들이 그런 만남을 경험했으면 한다.
      </h2>
    </div>
  );
}

export default App;
